{"name": "Definition Part 2", "submissionType": null, "githubLink": "https://github.com/navgurukul/newton/tree/master/python/basic-definition/definition-part-2.md", "solution": null, "reviewType": "peer", "id": 1863, "content": "# Definitions\n\n### Assignment (assign)\nThe act of putting any value to a variable using the equal sign (=) called an assignment.\nExample: my_num = 10, my_name = \"Isha\"\n\n### Brackets\nSome characters often used to surround text called brackets. The different types of brackets are:\n*Parenthesis/parens/round brackets: ( )\n*Curly brackets/braces: { }\n*Angle brackets: < >\n*Square brackets: [ ]\nThe bracket at the beginning is called the “opening” or the “left” bracket.\nThe bracket at the end is called the “closing” or “right” bracket.\nExample: print (my_name)\n\n### Comment\nThe arbitrary text written around code, but which is never run, and is generally ignored by the computer \ncalled comments. It is used to leave notes and documentation for people who read the code later.\n\n### Comment Out\nIt means to turn code into a comment so that it does not get run.\n\n### Compiler\nA program that converts code into an executable, and checks that the syntax is correct. \nSometimes compilers convert code into other code.\nExample: The compiler is giving me an error, so I must have incorrect syntax somewhere.\n\n### Loop\nA piece of code that runs itself repeatedly. Commonly used to run a piece code for every value in an array.\nAlso known as “iteration”. Example: The code loops until the user types in “quit” or until condition becomes false.\n\n### Run / Execute\nIt means to perform the instructions written in code or an executable. \nCode is a set of instructions, and “running” code is when the computer actually performs those instructions.\nTo “run” a function means to call that function.\n\n### Bugs and Debugs\nThe mistakes or error in code called bugs and to investigate and fix bugs called debuging.\n\n### Arguments / Parameters\n A value that is passed into a function when it is called.\n Arguments are said to be “passed” into a function, and functions are said to “take” arguments.\n \n ### Call\n Call means to run the code in a function. Also referred to as “running,” “executing,” or “invoking” a function. \n\n### Declaration \nCode that declares that something exists – usually a variable, function or a class.\nE.g. a constant may be declared to exist, without actually defining what it’s value is. \n\n### Float\nA type of value that represents numbers with fractional parts. In short “floating-point number”.\nExample: The value 3.14 is a float.\n\n### Function / Procedure\nA piece of code that is not run until it is called. Functions take zero or more arguments. \nWhen a function finishes running, it returns a return value back to the code that called it.\n\n### Value\n A piece of data that can be contained inside a variable.\n Every value has a type. Values represent information, in a way that code can work upon.\n \n ### Strings\n A sequence of characters in single or double quotes are called strings. Ex. \"Abc\", \"29\", \"$\", etc.\n \n ### Concatenation\nAdding two or more strings together called concatenation. Ex. \"Bill\" + \"Gates. Output will be \"BillGates\".\n\n### Conditions / Conditional Statement / Conditional expression\nA condition must evaluate to either true or false.\nUsually we use the greater then or less then or equal-equals == (equality test) to generate our boolean values.\n\n### Boolean \n The Boolean data type is a data type that has one of two possible values (usually denoted true and false),\n intended to represent the two truth values of logic.Their are only two possible boolean values: true and false . \n The default value for boolean is true.\n \n \n\n", "sequenceNum": 3001, "parentExerciseId": 1815, "slug": "python__basic-definition/definition-part-2"}